{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Honours Bachelor of Computer Science",
      "department": "Faculty of Science",
      "duration": "2019-2023",
      "school_name": "Wilfrid Laurier University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_ShailendraSingh",
  "highlighted_projects": [
    {
      "description": "Developed an image-hosting Discord bot that allows users to upload photos/files and organize them with folders. This allows users to easily access their saved photos for free anywhere the bot is, through simple commands on the fly. The bot was developed using C#, is hosted through Azure App Services and hosts all of its data using Azure Cosmos DB (NoSQL). Users can also access their data through a website developed with ASP.NET MVC. PhotoKeep currently serves over 213 users and hosts 1105 photos.",
      "git_url": "https://github.com/Shailosingh/Photokeep",
      "name": "PhotoKeep"
    },
    {
      "description": "Created a remake of the classic Windows XP version of *Minesweeper*. The game was created with C#, used WinUI 3 for the desktop version and Blazor WebAssembly for the web version. The game's logic was implemented as a separate modular library that was published as a NuGet package. This allows developers to easily make their own Minesweeper versions, with their own UIs, on any platform that supports .NET (Windows, Linux, MacOS, etc). The desktop version of the app was previously published on the Microsoft Store and had over 12,592 downloads.",
      "git_url": "https://github.com/Shailosingh/MineMaster",
      "name": "MineMaster"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a software solution to monitor a cluster of Linux machines and record their hardware specifications and performance statistics into a database. The solution is implemented by hosting a PostgreSQL database in a Docker container on one of the machines. Then all the machines have bash scripts installed that collect static hardware specifications at install time and performance statistics every minute through a cron job.",
      "git_url": "../develop/linux_sql",
      "name": "Linux Cluster Monitoring Agent"
    },
    {
      "description": "Implemented a simple version of the classic grep command line application. This application takes in an input directory that contains files, these files are scanned line-by-line, matched with a given regex pattern and those matched lines are printed in a specified output file. This project was developed using Java and its dependencies were managed via Maven.",
      "git_url": "../develop/core_java/grep",
      "name": "grep"
    },
    {
      "description": "Implemented a basic stock market simulator. This application uses the Alpha Vantage REST API to retrieve the most up-to-date quotes for any stock the user inputs. These quotes are cached into a PostgreSQL database. The user is then given the opportunity to buy and sell shares of certain stocks (positions). These purchases are also recorded in the database. This project was developed using Java and its dependencies were managed via Maven. The database was hosted on a Docker container.",
      "git_url": "../develop/core_java/jdbc",
      "name": "Stock Quote App"
    }
  ],
  "name": "Shailendra Singh",
  "others": [
    {
      "bullets": [
        "Databricks Lakehouse Fundamentals Accreditation (April 2024 - April 2025)"
      ],
      "title": "Certifications"
    },
    {
      "bullets": [
        "Recreational walking, cycling and swimming (Recently cycled from Brampton to Toronto in one go!)",
        "PC Gaming (MechWarrior, World of Warcraft, etc)",
        "Reverse Engineering using Ghidra, IDA Free and x32dbg",
        "Reading and learning about various topics such as mathematics, history and more"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "Working in a team, within an Agile/Scrum framework to develop many types of software using a variety of technologies. These include but are not limited to, Java, Linux, Bash, PostgreSQL, Docker and more.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "Self-employed",
      "description": "Helped students with Linear Algebra, Precalculus, Calculus and Discrete Mathematics. Guided various students by adapting teaching styles, to respond to individual needs and helps students gain confidence in mathematics, despite rampant mathematics anxiety. Every student passed the courses they were being guided through, regardless of their mathematical ability beforehand.",
      "duration": "2019-2023",
      "title": "Mathematics Tutor"
    }
  ],
  "skills": {
    "competent": [
      "Databricks",
      "Agile/Scrum",
      "Git",
      "ASP.NET",
      "HTML",
      "CSS",
      "XAML"
    ],
    "familiar": [
      "Bash",
      "Powershell",
      "Blazor WebAssembly",
      "Android Development",
      "Azure App Services",
      "Google Cloud Platform"
    ],
    "proficient": [
      "C#",
      "C++",
      "Java",
      "Python",
      "Scala",
      "Win32 Application Development",
      ".NET Application Development"
    ]
  },
  "summary": "I am a software developer absolutely fascinated by everything software and making otherwise dumb machines like computers do intelligent tasks. I have been programming for over 10 years and through that time I have gained experience with everything from Windows application development to web development and bots. I studied at Wilfrid Laurier University, for a Bachelor of Science in Computer Science and a Mathematics Minor. I have made many pieces of software not only for fun but to also solve serious problems my peers and I face. While I am most experienced with C++, C# and the .NET tech stack, I know many other technologies and languages. I find learning new technologies and creating new projects with them, incredibly fun and rewarding. Not only this but I'm also a natural learner so I will never have any problems developing software for any language or tech stack asked of me."
}
